In [8]:
import duckdb
import pandas as pd
from IPython.display import display
df=pd.read_csv(r"C:\MY SPACE\Data Science and Gen AI\Abhishek-Data-Science-Portfolio\SQL\SQL PRACTICE\E-COMMERCE\data\flipkart.csv")
conn=duckdb.connect()
conn.register("flipkart",df)
result=conn.execute("select country from flipkart where age>=50 and gender='Female' group by country").df()
print(result)
display(df.head(5))

     country
0     Brazil
1      Japan
2         UK
3      China
4     France
5        USA
6     Canada
7  Australia
8      India
9    Germany

,user_id,age,gender,country,urban_rural,income_level,employment_status,education_level,relationship_status,has_children,...,cart_items_average,checkout_abandonments_per_month,purchase_conversion_rate,app_usage_frequency,notification_response_rate,account_age_months,last_purchase_date,social_sharing_frequency,premium_subscription,return_rate
0,1,56,Female,Germany,Suburban,90860,Self-employed,Associate Degree,Single,0,...,10,2,62,7,74,19,2025-06-22,6,1,50
1,2,69,Male,Japan,Suburban,35423,Unemployed,Bachelor,Single,1,...,5,7,54,5,23,8,2026-07-25,3,0,37
2,3,46,Female,India,Urban,21467,Self-employed,Associate Degree,Married,1,...,3,3,33,7,12,13,2026-02-26,6,0,53
3,4,32,Male,Canada,Urban,41770,Self-employed,Bachelor,Widowed,0,...,5,9,26,4,19,9,2026-10-27,7,0,98
4,5,60,Female,Japan,Urban,183882,Employed,Associate Degree,Widowed,1,...,8,0,18,7,30,3,2026-06-23,3,0,86

In [2]:
result=conn.execute("select country from flipkart where age>=50 and gender='Male' group by country").df()
print(result)

     country
0      India
1    Germany
2         UK
3     France
4      China
5        USA
6     Canada
7     Brazil
8      Japan
9  Australia

In [20]:
result = conn.execute("""select country, gender, count(1) from flipkart group by 1,2
 """).df()
display(result.head(10))

     country      gender  count(1)
0    Germany        Male     48231
1    Germany      Female     47896
2     Brazil  Non-binary      2044
3     Canada       Other      2063
4         UK  Non-binary      1980
5  Australia       Other      1986
6     France  Non-binary      2022
7     France      Female     47985
8         UK      Female     47898
9     France        Male     47975

In [22]:
result=conn.execute(""" select country, count(*) as male_count from flipkart
                    where gender='Male'
                    group by country
                    order by male_count desc
""").df()
display(result)

     country  male_count
0      China       48345
1     Brazil       48257
2    Germany       48231
3     Canada       48116
4         UK       48061
5  Australia       48053
6     France       47975
7        USA       47803
8      India       47725
9      Japan       47566

In [ ]:
result=conn.execute(""" select country,gender, count(*) as count from flipkart
                    where gender in ('Male','Female','Other')
                    group by country,gender
                    order by country, count desc
""").df()
display(result)

      country  gender  count
0   Australia    Male  48053
1   Australia  Female  47868
2   Australia   Other   1986
3      Brazil    Male  48257
4      Brazil  Female  48149
5      Brazil   Other   2026
6      Canada  Female  48176
7      Canada    Male  48116
8      Canada   Other   2063
9       China    Male  48345
10      China  Female  47937
11      China   Other   1962
12     France  Female  47985
13     France    Male  47975
14     France   Other   2010
15    Germany    Male  48231
16    Germany  Female  47896
17    Germany   Other   1970
18      India  Female  48171
19      India    Male  47725
20      India   Other   1951
21      Japan    Male  47566
22      Japan  Female  47552
23      Japan   Other   1938
24         UK    Male  48061
25         UK  Female  47898
26         UK   Other   1936
27        USA  Female  48176
28        USA    Male  47803
29        USA   Other   1995

In [34]:
result=conn.execute(""" select
             sum(case when gender='Male' then 1 else 0 end) as male_count,
             sum(case when gender='Female' then 1 else 0 end) as female_count,
             sum(case when gender='Other' then 1 else 0 end) as other_count
            from flipkart where gender in ( 'Male','Female','Other')
""").df()
display(result)

   male_count  female_count  other_count
0    480132.0      479808.0      19837.0